# Тема: Використання змінних та базових типів даних

# Завдання:
# 1. Створіть змінну `bookTitle` та присвойте їй назву вашої улюбленої книги у вигляді рядка.
# 2. Створіть змінну `pagesCount` та присвойте їй кількість сторінок цієї книги у вигляді цілого числа.
# 3. Створіть змінну `rating` та присвойте їй рейтинг цієї книги на вашу думку
# у вигляді числа з плаваючою комою (наприклад, 4.5 з 5).
# 4. Виведіть на екран повідомлення у форматі:
# "Моя улюблена книга - [bookTitle]. Вона має [pagesCount] сторінок і я оцінив її в [rating] балів."

# Очікуваний результат:
# ```
# Моя улюблена книга - "1984". Вона має 328 сторінок і я оцінив її в 4.9 балів.
# ```
# Примітка: Замініть "1984", "328" та "4.9" на власні значення, які ви ввели.

# Створення змінних з інформацією про вашу улюблену книгу
bookTitle = "Чорний лев"
pagesCount = 119
rating = 5

# Виведення повідомлення з використанням змінних
print(
    f"Моя улюблена книга - \"{bookTitle}\". Вона має {pagesCount} сторінок і я оцінив її в {rating} балів."
)
