# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `city` та присвойте їй назву міста, де ви народилися, у вигляді рядка.
# 2. Створіть змінну `population` та присвойте їй приблизну кількість населення цього міста у вигляді цілого числа.
# 3. Створіть змінну `area` та присвойте їй площу цього міста
# у квадратних кілометрах у вигляді числа з плаваючою комою (наприклад, 142.7).
# 4. Виведіть на екран повідомлення у форматі:
# "Я народився в місті [city], де приблизно [population] людей. Площа цього міста - [area] кв. км."

# Очікуваний результат:
# Я народився в місті Львів, де приблизно 720000 людей. Площа цього міста - 182.8 кв. км.

# Примітка: Замініть "Львів", "720000" та "182.8" на власні значення, які ви ввели.
