# Тема: Закріплення базових типів даних: int, float, string

# Завдання:
# Напишіть програму, яка виводить інформацію про вас за допомогою функції `print`.
# Ви маєте використовувати різні типи даних для введення своїх особистих даних:

# 1. Створіть змінну `name` і присвойте їй ваше ім'я (рядок).
# 2. Створіть змінну `age` і присвойте їй ваш вік (ціле число).
# 3. Створіть змінну `height` і присвойте їй ваш ріст (десяткове число).
# 4. Виведіть інформацію про себе, використовуючи функцію `print`, у наступному форматі:

# ```
# Мене звати [ім'я]. Мені [вік] років і мій ріст - [ріст] метрів.
# ```

# Очікуваний результат:
# ```
# Мене звати Іван. Мені 25 років і мій ріст - 1.75 метрів.
# ```
