# ```
# Тема: Використання оператора del для видалення елементів списку.

# Завдання: У вас є список `mobileBrands`, що включає такі марки телефонів:
# ['Apple', 'Samsung', 'Xiaomi', 'Nokla', 'OnePlus'].
# Ви повинні видалити марку 'Nokla' з цього списку, використовуючи оператор `del`.
# Визначте індекс 'Nokla' в списку і видаліть цей елемент.
# Після виконання операції виведіть на екран оновлений список `mobileBrands`.

# Очікуваний результат: Після запуску програми, в консолі має бути виведений оновлений список `mobileBrands`
# без елемента 'Nokla':
# ```
# ```
# ['Apple', 'Samsung', 'Xiaomi', 'OnePlus']
# ```

# Створюємо список з марками телефонів
mobileBrands = ["Apple", "Samsung", "Xiaomi", "Nokla", "OnePlus"]

# Визначаємо індекс елемента 'Nokla'

# Видаляємо елемент за індексом
del mobileBrands[3]

# Виводимо оновлений список
print(mobileBrands)
