# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `movie` та присвойте їй назву фільму, який ви нещодавно дивилися, у вигляді рядка.
# 2. Створіть змінну `duration` та присвойте їй тривалість цього фільму у хвилинах у вигляді цілого числа.
# 3. Створіть змінну `rating` та присвойте їй вашу особисту оцінку фільму
# у вигляді числа з плаваючою комою (наприклад, 8.7).
# 4. Виведіть на екран повідомлення у форматі:
# "Нещодавно я дивився фільм [movie], який триває [duration] хвилин. Моя особиста оцінка - [rating] з 10."

# Очікуваний результат:
# Нещодавно я дивився фільм "Інтерстеллар", який триває 169 хвилин. Моя особиста оцінка - 9.5 з 10.

# Примітка: Замініть "Інтерстеллар", "169" та "9.5" на власні значення, які ви ввели.
