# Тема: Розрахунок щомісячного платежу за кредитом.

# Завдання:
# Створіть програму на Python, яка допомагає користувачеві обчислити щомісячний платіж за кредитом.
# Програма повинна:
# 1. Запитати суму кредиту, яку користувач хоче взяти.
# 2. Запитати процентну ставку за кредитом на рік.
# 3. Запитати термін кредитування у місяцях.
# 4. Використати формулу ануїтетного платежу для обчислення щомісячного платежу.
# 5. Вивести користувачеві повідомлення з розміром щомісячного платежу.

# Формула ануїтетного платежу:
# Щомісячний платіж =
# (Сума кредиту * (Процентна ставка / 12)) / (1 - (1 + Процентна ставка / 12)^(-Термін кредитування))

# Очікуваний результат:
# ```
# Введіть суму кредиту: 50000
# Введіть процентну ставку за рік (у %): 10
# Введіть термін кредитування у місяцях: 12
# Ваш щомісячний платіж складатиме: 4387.86 UAH
# ```
credit = int(input("Введіть суму кредита "))
percent = int(input("Введіть процентну ставку за рік (у %) ")) / 100
term = int(input("Введіть термін кредитування у місяцях "))
monthly_interest_rate = percent / 12
monthly_payment = (credit * monthly_interest_rate) / (1 - (1 + monthly_interest_rate) ** (-term))
print(f"Ваш щомісячний платіж складатиме: {monthly_payment.__round__(2)}")


