# Створіть програму, яка запитує у користувача два цілих числа a і b, після чого виводить на екран результати таких математичних операцій:
# - сума a і b;
# - різниця між a і b;
# - добуток a і b;
# - частка від ділення a на b;
# - залишок від ділення a на b;
# - результат піднесення числа a до степеня b.



a = float(input("Введіть значення "))
b = float(input("Введіть значення "))

multiline_text = f'''a+b = {a+b}, 
a-b = {a-b},
a/b = {a/b},
a*b = {a*b}
залишок від ділення a на b = {a%b},
a**b= {a**b}
'''
print(multiline_text)