# Тема:
# Використання логічних операторів and у умовних конструкціях.

# Завдання:
# Створіть програму, яка запитує у користувача вік (age) та кількість відпрацьованих років (yearsOfWork).
# Програма має визначити, чи користувач може йти на пенсію, враховуючи наступні умови:
# - Якщо вік користувача 65 років або більше і кількість відпрацьованих років 20 або більше,
# то користувач може йти на пенсію;
# - Якщо вік користувача 60 років або більше і кількість відпрацьованих років 30 або більше,
# то користувач також може йти на пенсію;
# - В усіх інших випадках користувач не може йти на пенсію.

# Програма повинна вивести повідомлення "Ви можете йти на пенсію" або "Ви ще не можете йти на пенсію",
# залежно від введених даних.

# Очікуваний результат:
# Користувач вводить свій вік та кількість відпрацьованих років, а програма виводить,
# чи користувач може йти на пенсію згідно з вищевказаними критеріями.


try:
    age = int(input("Введіть ваш вік: "))
    years_of_work = int(input("Введіть кількість відпрацьованих років: "))
    
    if (age >= 65 and years_of_work >= 20) or (age >= 60 and years_of_work >= 30):
        print("Ви можете йти на пенсію.")
    else:
        print("Ви ще не можете йти на пенсію.")
except ValueError:
    print("Некоректний ввод. Будь ласка, введіть дійсний вік та кількість відпрацьованих років.")
