# Тема:
# Використання оператора `or` у розгалуженні програми.

# Завдання:
# Уявіть, що ви розробляєте систему знижок для магазину.
# Клієнт отримує знижку, якщо він є членом клубу покупців ('isClubMember' == True)
# або його покупка перевищує 1000 гривень ('purchaseAmount' > 1000). Напишіть код,
# який запитує у користувача, чи є він членом клубу (ввести "так" або "ні")
# і вартість його покупки, а потім виводить "Ви отримали знижку!" або "Знижка не надається".

# Очікуваний результат:
# Користувач вводить свій статус члена клубу та суму покупки.
# На основі введеної інформації програма визначає, чи отримає клієнт знижку.

# Запитання у користувача для введення статусу члена клубу та вартості покупки
is_club_member = input("Чи є ви членом клубу покупців? (так/ні): ").lower() == "так"
purchase_amount = float(input("Введіть вартість вашої покупки: "))

# Перевірка умов для отримання знижки та виведення відповідного повідомлення
if is_club_member or purchase_amount > 1000:
    print("Ви отримали знижку!")
else:
    print("Знижка не надається.")
