# Тема: Дані про книгу

# Завдання:
# 1. Створіть змінну `bookTitle` та присвойте їй назву будь-якої книги.
# 2. Створіть змінну `numberOfPages` та присвойте їй кількість сторінок цієї книги у вигляді цілого числа.
# 3. Створіть змінну `price` та присвойте їй вартість книги у вигляді числа з плаваючою комою.
# 4. Виведіть на екран інформацію у форматі:
# "Книга під назвою [bookTitle] має [numberOfPages] сторінок і коштує [price] гривень."

# Очікуваний результат:
# ```
# Книга під назвою "Гаррі Поттер" має 400 сторінок і коштує 350.5 гривень.
# ```

# Примітка: Замініть "Гаррі Поттер", "400" та "350.5" на власні значення, які ви ввели.
