# ```
# Тема: Видалення елемента зі списку за допомогою методу list.pop() із застосуванням input.

# Завдання: Уявіть, що ви розробляєте простий менеджер завдань (todo list).
# Створіть список із назвою `tasks`, який спочатку містить такі завдання:
# "Зробити домашнє завдання", "Піти в магазин", "Подзвонити другу", "Приготувати обід", "Прочитати книгу".
# Програма повинна вивести список завдань, після чого запитати у користувача "Яке завдання ви виконали?
# Введіть номер:", де номер відповідає індексу завдання в списку, починаючи з 1.
# Видаліть відповідне завдання зі списку за допомогою методу `pop()` і виведіть оновлений список на екран.

# Очікуваний результат: Перш ніж користувач введе номер завдання, програма виводить список завдань:

# 1. Зробити домашнє завдання
# 2. Піти в магазин
# 3. Подзвонити другу
# 4. Приготувати обід
# 5. Прочитати книгу

# Якщо користувач вводить номер 3, оновлений список має виглядати так:

# 1. Зробити домашнє завдання
# 2. Піти в магазин
# 3. Приготувати обід
# 4. Прочитати книгу
# ```

tasks = []
tasks.append("Зробити домашнє завдання")
tasks.append("Піти в магазин")
tasks.append("Подзвонити другу")
tasks.append("Приготувати обід")
tasks.append("Прочитати книгу")

for task in tasks:
    print(str(tasks.index(task)+1)+": "+ task)

taskindex = int(input("Яке завдання ви виконали? Введіть номер: "))
tasks.pop(taskindex-1)

index = 1
for task in tasks:
    print(str(index)+": "+ task)
    index+= 1