# 1. Є дві множини A = {3, 5, 11, 7, 4, -3} та B = {11, 5, 8, 1, 10, 7}.
# Вивести в консоль елементи A, яких немає в B.
# Вивести в консоль елементи B, яких немає в A.
# Вивести в консоль спільні елементи A і B.
# Вивести в консоль об'єднання множин A і B.

# Задані множини A та B
A = {3, 5, 11, 7, 4, -3}
B = {11, 5, 8, 1, 10, 7}

# Елементи A, яких немає в B
elementsA = A - B
print("Елементи A, яких немає в B:", elementsA)

# Елементи B, яких немає в A
elementsB = B - A
print("Елементи B, яких немає в A:", elementsB)

# Спільні елементи A і B
elementsC = A.intersection(B)
print("Спільні елементи A і B:", elementsC)

# Об'єднання множин A і B
elementsD = A.union(B)
print("Об'єднання множин A і B:", elementsD)
