# Тема: Реєстрація користувачів на заході
# Завдання: Напишіть функцію `register_user`, яка запитує у користувача його ім'я та email,
# а потім додає цю інформацію до словника `user_registry`.
#
# Ключем у словнику повинен бути email, а значенням - ім'я користувача.
# Створіть другу функцію `display_users`, яка виводить список всіх зареєстрованих користувачів.
# Організуйте цикл, в якому користувач може ввести декілька разів команду 'register' для реєстрації або 'display'
# для відображення зареєстрованих користувачів. Цикл завершується, коли користувач вводить 'exit'.

# Очікуваний результат: Якщо користувач вводить 'register',
# вказує своє ім'я та email, а потім вводить 'display',
# програма виводить список усіх зареєстрованих користувачів.

# Послідовність виконання:
# 1. Визначте функцію `register_user`, яка запитує ім'я та email користувача та додає ці дані
# до словника `user_registry`.
# 2. Визначте функцію `display_users` для виводу інформації про зареєстрованих користувачів.
# 3. Організуйте головний цикл, який читає команди від користувача ('register', 'display', 'exit').
# 4. Використовуйте умовні оператори для визначення дій, які потрібно виконати в залежності від введеної команди.
