# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача радіус кола через `input()`.
# Програма повинна обчислювати і виводити площу та довжину окружності цього кола.
# Використовуйте константу `pi` з модуля `math`.

# Очікуваний результат:
# ```
# Введіть радіус кола: 5

# Результати:
# Площа кола: 78.53981633974483
# Довжина окружності: 31.41592653589793

from numpy import pi


'''
Площа кола обчислюється за формулою:

S = π * r^2,

де S - площа кола, π (пі) - математична константа, приблизно 3.14159, і r - радіус кола.

Довжина окружності кола обчислюється за формулою:

C = 2 * π * r,

де C - довжина окружності, π (пі) - математична константа, приблизно 3.14159, і r - радіус кола.
'''

r = float(input('Введіть радіус кола: '))

s = pi * r
c = 2 * pi * r

print(f'Площа кола - {s:.2f}')
print(f'Довжина окружності - {c:.2f}')
