# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача ціну одного товару та
# кількість куплених товарів через `input()`.
# Програма повинна обчислювати загальну вартість покупки та виводити її на екран.

# Очікуваний результат:
# ```
# Введіть ціну товару: 150.5
# Введіть кількість товарів: 3

# Загальна вартість покупки: 451.5 грн.

price = float(input('Введіть ціну товару: '))
count = int(input('Введіть кількість товарів: '))

print(f'Загальна вартість покупки: {price * count} грн.')
