# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `instrument` та присвойте їй назву музичного інструменту, який вам подобається, у вигляді рядка.
# 2. Створіть змінну `years` та присвойте їй кількість років,
# протягом яких ви б воліли вчити грати на цьому інструменті, у вигляді цілого числа.
# 3. Створіть змінну `price` та присвойте їй приблизну вартість цього музичного інструменту
# у вигляді числа з плаваючою комою (наприклад, 2500.50).
# 4. Виведіть на екран повідомлення у форматі:
# "Я обожнюю [instrument] і хотів би вчитися грати на ньому протягом [years] років.
# Його приблизна вартість - [price] гривень."

# Очікуваний результат:
# Я обожнюю гітару і хотів би вчитися грати на ньому протягом 3 років.
# Його приблизна вартість - 2500.50 гривень.

# Примітка: Замініть "гітару", "3" та "2500.50" на власні значення, які ви ввели.


# ok lets go)))
instrument = "Пианино" # :D
years = 9 # ...
price = 500000.01 # :(
print(f"Я обожнюю {instrument} і хотів би вчитися грати на ньому протягом {years} років.\nЙого приблизна вартість - {price} гривень.") # output message
# end of task