# Тема: Цикли while

# Завдання: Напишіть програму на Python, яка запитує у користувача ввести максимальне число,
# а потім використовує цикл while для виведення всіх парних чисел, починаючи з 1 і
# не перевищуючи введене користувачем число. Програма має використовувати змінні
# для зберігання поточного числа та заданого максимального числа.
#
# Цикл має припинити свою роботу, коли поточне число стане більше або рівним максимальному числу,
# введеному користувачем.

# Очікуваний результат: Якщо користувач введе максимальне число 10,
# програма повинна послідовно вивести на екран парні числа від 1 до 10:
# ```
# 2
# 4
# 6
# 8
# 10
# ```

# Послідовність виконання:
# 1. Запросіть користувача ввести максимальне число і збережіть його в змінній max_number.
# 2. Ініціалізуйте змінну current_number зі значенням 1.
# 3. Встановіть цикл while, який буде виконуватися, поки current_number менше або дорівнює max_number.
# 4. Усередині циклу, використайте if-оператор для перевірки, чи є current_number парним числом,
# перевіряючи, чи залишок від ділення current_number на 2 дорівнює нулю. (оператор %)
# 5. Якщо current_number є парним, виведіть його на екран.
# 6. Збільште current_number на одиницю перед кожною наступною ітерацією циклу.

max_number = int(input("Введіть максимальне число:  "))

current_number = 1

while current_number <= max_number:
  if current_number % 2 == 0:
   print(current_number)
 
  
current_number += 1 