# ```
# Тема: Підрахунок кількості входжень елемента в список за допомогою методу list.count() із застосуванням input.

# Завдання: Ви розробляєте функцію для аналізу відгуків про кінофільми. Створіть список із назвою `reviews`,
# який містить слова, які ви взяли із відгуків: "чудовий", "нудний", "цікавий", "чудовий", "нудний", "середній".
# Програма повинна попросити користувача ввести слово для аналізу (наприклад, "чудовий")
# і використати метод `count()` для визначення, скільки разів це слово зустрічається
# в списку `reviews`. Результат підрахунку виведіть на екран.

# Очікуваний результат:
# Програма запитує в користувача "Яке слово ви хочете проаналізувати?".
# Якщо користувач вводить слово "чудовий", програма виводить: "Слово 'чудовий' зустрічається у відгуках 2 рази".
# ```
