# ```
# Тема: Розширення списку за допомогою методу extend().

# Завдання: Маємо два списки, `primaryColors` і `secondaryColors`.
# Список `primaryColors` містить елементи 'червоний', 'зелений', 'синій'.
# Список `secondaryColors` містить елементи 'помаранчевий', 'зелений', 'фіолетовий'.
# Використовуйте метод `extend()`, щоб додати усі елементи з `secondaryColors` до `primaryColors`.
# Після цього виведіть оновлений список `primaryColors` на екран.

# Очікуваний результат: Консоль повинна показати оновлений список `primaryColors`
# з усіма елементами обох списків, як показано нижче:
# ```
# ```
# ['червоний', 'зелений', 'синій', 'помаранчевий', 'зелений', 'фіолетовий']
# ```
primaryColors = ['червоний','зелений','синій']
secondaryColors = ['помаранчевий','зелений','фіолетовий']
primaryColors.extend(secondaryColors)
print(primaryColors)