# Тема: Характеристики автомобіля

# Завдання:
# 1. Створіть змінну `carBrand` та присвойте їй назву будь-якого автомобіля.
# 2. Створіть змінну `maxSpeed` та присвойте їй максимальну швидкість цього автомобіля у вигляді цілого числа.
# 3. Створіть змінну `fuelConsumption` та присвойте їй витрати пального на 100км у вигляді числа з плаваючою комою.
# 4. Виведіть на екран інформацію у форматі:
# "Автомобіль марки [carBrand] може розвинути швидкість до [maxSpeed] км/год.
# Витрати пального - [fuelConsumption] л/100км."

# Очікуваний результат:
# ```
# Автомобіль марки "Tesla" може розвинути швидкість до 250 км/год.
# Витрати пального - 0.0 л/100км.
# ```
# Примітка: Замініть "Tesla", "250" та "0.0" на власні значення, які ви ввели.
