# Тема: Розрахунок прибутковості інвестицій у криптовалюту.

# Завдання:
# Створіть програму, яка допоможе користувачу розрахувати прибуток від інвестицій у криптовалюту. Програма має:
# 1. Запросити користувача ввести суму інвестицій у криптовалюту (у доларах).
# 2. Запросити користувача ввести курс купівлі криптовалюти (скільки доларів за одиницю криптовалюти на момент купівлі).
# 3. Запросити користувача ввести поточний курс криптовалюти.
# 4. Вивести на екран прибуток (або збиток) від інвестицій у доларах.

# Очікуваний результат:
# ```
# Введіть суму інвестицій у криптовалюту (USD): 1000
# Введіть курс купівлі криптовалюти (USD за 1 криптовалюту): 100
# Введіть поточний курс криптовалюти (USD за 1 криптовалюту): 150
# Прибуток від інвестицій: 500 USD.
# ```

investment_amount = float(input("Введіть суму інвестицій у криптовалюту (USD): "))

purchase_rate = float(
    input("Введіть курс купівлі криптовалюти (USD за 1 криптовалюту): ")
)

current_rate = float(
    input("Введіть поточний курс криптовалюти (USD за 1 криптовалюту): ")
)

number_of_coins = investment_amount / purchase_rate
current_value = number_of_coins * current_rate
profit = current_value - investment_amount

if profit > 0:
    print(f"Прибуток від інвестицій: {profit} USD.")
else:
    print(f"Збиток від інвестицій: {-profit} USD.")
