# ```
# Тема: Сортування списку за допомогою методу sort() та отримання даних від користувача через input.

# Завдання: Напишіть програму, яка запитує у користувача ввести три числа, одне за одним. Кожне число користувач
# вводить після підказки "Введіть число:" і натискання Enter.
# Ваша програма має зберігати ці числа у списку з назвою `numbersList`.
# Після збору всіх трьох чисел, використайте метод `sort()`
# для сортування списку `numbersList` від найменшого до найбільшого числа.
# Виведіть відсортований список на екран.

numbersList = []
i = 0

while i < 3:
    numbersList.append(int(input("Введіть число: ")))
    i += 1

numbersList.sort()

print(numbersList)

# Очікуваний результат:
# Програма запитує у користувача три числа, зберігає їх у списку, сортує список та виводить його.
# Наприклад, якщо користувач ввів числа 56, 23 та 78, відсортований список має виглядати так:
# ```
# ```
# [23, 56, 78]
# ```
