# ```
# Тема: Видалення елемента зі списку за допомогою методу list.pop() із застосуванням input.

# Завдання: Уявіть, що ви розробляєте простий менеджер завдань (todo list).
# Створіть список із назвою `tasks`, який спочатку містить такі завдання:
# "Зробити домашнє завдання", "Піти в магазин", "Подзвонити другу", "Приготувати обід", "Прочитати книгу".
# Програма повинна вивести список завдань, після чого запитати у користувача "Яке завдання ви виконали?
# Введіть номер:", де номер відповідає індексу завдання в списку, починаючи з 1.
# Видаліть відповідне завдання зі списку за допомогою методу `pop()` і виведіть оновлений список на екран.

tasks = ["Зробити домашнє завдання", 
         "Піти в магазин", 
         "Подзвонити другу", 
         "Приготувати обід", 
         "Прочитати книгу"]

while True:
    listLength = len(tasks)
    i = 1

    if listLength == 0:
        print("\nВи виконали всі завдання!\n")
        break
    else:
        None

    while i - 1 < listLength:
        print(f"{i}.", tasks[i - 1])
        i += 1

    tasks.pop(int(input("\nЯке завдання Ви виконали?\nВведіть номер: ")) - 1)

# Очікуваний результат: Перш ніж користувач введе номер завдання, програма виводить список завдань:

# 1. Зробити домашнє завдання
# 2. Піти в магазин
# 3. Подзвонити другу
# 4. Приготувати обід
# 5. Прочитати книгу

# Якщо користувач вводить номер 3, оновлений список має виглядати так:

# 1. Зробити домашнє завдання
# 2. Піти в магазин
# 3. Приготувати обід
# 4. Прочитати книгу
# ```
