# ```
# Тема: Використання від'ємних індексів для доступу до елементів списку.

# Завдання: Створіть список з назвою `colors`, який містить назви кольорів (як рядки),
# наприклад, `['червоний', 'зелений', 'синій', 'жовтий', 'фіолетовий']`.
# Ваша програма має вивести на екран останній елемент списку, використовуючи від'ємну індексацію,
# а потім передостанній елемент, також використовуючи від'ємну індексацію.

colors = ['червоний', 'зелений', 'синій', 'жовтий', 'фіолетовий']
i = -1

while i > -3:
    print(colors[i])
    i -= 1

# Очікуваний результат: Коли ваша програма буде виконана, вона має вивести наступне в консоль:
# ```
# ```
# фіолетовий
# жовтий
# ```
