# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача два числа через `input()`.
# Програма повинна виконувати базові арифметичні операції (додавання, віднімання, множення, ділення)
# з цими числами і виводити результати на екран.

# Очікуваний результат:
# ```
# Введіть перше число: 5
# Введіть друге число: 3

# Результати:
# 5 + 3 = 8
# 5 - 3 = 2
# 5 * 3 = 15
# 5 / 3 = 1.6666666666666667

Num1 = int(input (' Введіть перше число '))
Num2 = int(input (' Введіть друге число '))

Multiplication = Num1 * Num2
Division = Num1 / Num2
appending = Num1 + Num2
Subtraction = Num1 - Num2

print(f"{Num1} * {Num2} = {Multiplication}")
print(f"{Num1} / {Num2} = {Division}")
print(f"{Num1} + {Num2} = {appending}")
print(f"{Num1} - {Num2} = {Subtraction}")