# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача два числа через `input()`.
# Програма повинна виконувати базові арифметичні операції (додавання, віднімання, множення, ділення)
# з цими числами і виводити результати на екран.

# Очікуваний результат:
# ```
# Введіть перше число: 5
# Введіть друге число: 3

# Результати:
# 5 + 3 = 8
# 5 - 3 = 2
# 5 * 3 = 15
# 5 / 3 = 1.6666666666666667

число1 = int(input (' Введіть перше число '))
число2 = int(input (' Введіть друге число '))

Множення = число1 * число2
Ділення = число1 / число2
Додавання = число1 + число2
Віднімання = число1 - число2

print(f"{число1} * {число2} = {Множення}")
print(f"{число1} / {число2} = {Ділення}")
print(f"{число1} + {число2} = {Додавання}")
print(f"{число1} - {число2} = {Віднімання}")