# ```
# Тема: Розрахунок середньої вартості обідів за тиждень.

# Завдання:
# Напишіть програму, яка запитує в користувача вартість обіду в ресторані за кожен день
# тижня (понеділок через неділю), зберігає введені дані в змінні, після чого розраховує
# та виводить на екран середню вартість обіду за тиждень.

# Очікуваний результат:
# ```
# Введіть вартість обіду в понеділок: 90
# Введіть вартість обіду у вівторок: 85
# Введіть вартість обіду в середу: 80
# Введіть вартість обіду в четвер: 75
# Введіть вартість обіду в п'ятницю: 90
# Введіть вартість обіду в суботу: 100
# Введіть вартість обіду в неділю: 120

# Середня вартість обіду за тиждень: 91.43 грн.
# ```

price1 = int(input ('Введіть вартість обіду в понеділок: '))
price2 = int(input ('Введіть вартість обіду в вівторок: '))
price3 = int(input ('Введіть вартість обіду в середу: '))
price4 = int(input ('Введіть вартість обіду в четвер: '))
price5 = int(input ('Введіть вартість обіду в пятницю: '))
price6 = int(input ('Введіть вартість обіду в суботу: '))
price7 = int(input ('Введіть вартість обіду в неділю: '))
total_cost = price1 + price2 + price3 + price4 + price5 + price6 + price7
average_cost = total_cost / 7
print (f'Cередня вартість обіду за тиждень: {average_cost}')