# ```
# Тема: Розрахунок середньої вартості обідів за тиждень.

# Завдання:
# Напишіть програму, яка запитує в користувача вартість обіду в ресторані за кожен день
# тижня (понеділок через неділю), зберігає введені дані в змінні, після чого розраховує
# та виводить на екран середню вартість обіду за тиждень.

# Очікуваний результат:
# ```
# Введіть вартість обіду в понеділок: 90
# Введіть вартість обіду у вівторок: 85
# Введіть вартість обіду в середу: 80
# Введіть вартість обіду в четвер: 75
# Введіть вартість обіду в п'ятницю: 90
# Введіть вартість обіду в суботу: 100
# Введіть вартість обіду в неділю: 120

# Середня вартість обіду за тиждень: 91.43 грн.
# ```

Вартість1 = int(input ('Введіть вартість обіду в понеділок: '))
Вартість2 = int(input ('Введіть вартість обіду в вівторок: '))
Вартість3 = int(input ('Введіть вартість обіду в середу: '))
Вартість4 = int(input ('Введіть вартість обіду в четвер: '))
Вартість5 = int(input ('Введіть вартість обіду в пятницю: '))
Вартість6 = int(input ('Введіть вартість обіду в суботу: '))
Вартість7 = int(input ('Введіть вартість обіду в неділю: '))
Спільна_вартість = Вартість1 + Вартість2 + Вартість3 + Вартість4 + Вартість5 + Вартість6 + Вартість7
Середня_вартість = Спільна_вартість / 7
print (f'Cередня вартість обіду за тиждень: {Середня_вартість}')