# Тема: Конвертація валют.

# Завдання:
# Створіть програму, яка запитує у користувача суму в гривнях,
# потім запитує курс долара до гривні, і на основі цих даних розраховує та виводить суму в доларах.

# Очікуваний результат:
# ```
# Введіть суму в гривнях: 2700
# Введіть курс долара: 27

# Сума в доларах: 100.00 USD

# Запитуємо у користувача суму в гривнях
amount_in_uah = int(input("Введіть суму в гривнях: "))

# Запитуємо у користувача курс долара до гривні
exchange_rate = int(input("Введіть курс долара до гривні: "))

# Розраховуємо суму в доларах
amount_in_usd = amount_in_uah / exchange_rate

# Виводимо результат
print(f"Сума в доларах: {amount_in_usd:.2f} USD")