# Тема: Дані про кінотеатр

# Завдання:
# 1. Створіть змінну `cinemaName` і присвойте їй назву будь-якого кінотеатру.
# 2. Створіть змінну `hallsCount` і присвойте їй кількість залів у цьому кінотеатрі у вигляді цілого числа.
# 3. Створіть змінну `ticketPrice` і присвойте їй вартість квитка у цьому кінотеатрі у вигляді числа з плаваючою комою.
# 4. Виведіть на екран інформацію у форматі:
# "В кінотеатрі [cinemaName] [hallsCount] залів. Середня ціна квитка - [ticketPrice] грн."

# Очікуваний результат:
# ```
# В кінотеатрі "Космос" 5 залів. Середня ціна квитка - 90.5 грн.
# ```
# Примітка: Замініть "Космос", "5" та "90.5" на власні значення, які ви ввели.
