# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача ширину,
# довжину та висоту кімнати в метрах через `input()`.
# Програма повинна розраховувати об'єм кімнати та вивести це значення на екран.

# Очікуваний результат:
# ```
# Введіть ширину кімнати (м): 4
# Введіть довжину кімнати (м): 5
# Введіть висоту кімнати (м): 2.5

# Об'єм кімнати: 50.0 куб. м.
# ```

width = float(input("Введіть ширину кімнати (м): "))
length = float(input("Введіть довжину кімнати (м): "))
height = float(input("Введіть висоту кімнати (м): "))

print(f"Об'єм кімнати: {width*length*height} куб. м.")