# Тема: Обробка замовлення в кафе з використанням циклів та словників

# Завдання:
# Уявіть, що ви пишете програму для кафе, де клієнти можуть замовляти різні напої.
# Створіть словник `menu_prices`, де ключами будуть назви напоїв, а значеннями - їх ціни.
# Після цього, напишіть код, який запитує у користувача, що він хоче замовити,
# і додає ціну обраного напою до загальної суми замовлення. Якщо користувач вводить "end",
# програма повинна вивести загальну суму замовлення.

# Очікуваний результат:
# Наприклад, якщо в `menu_prices` є напої {"coffee": 10, "tea": 7, "water": 5},
# і користувач замовляє "coffee" та "water", а потім вводить "end",
# програма виводить "Загальна сума замовлення: 15".

# Послідовність виконання:
# 1. Створіть словник `menu_prices` з назвами страв та їхніми цінами.
# 2. Ініціалізуйте змінну для зберігання загальної вартості замовлення.
# 3. Використовуйте цикл для читання вводу від користувача.
# 4. Якщо введено назву страви, яка є в словнику, додайте її вартість до загальної суми.
# 5. Якщо введено "end", виведіть загальну вартість замовлення.

menu_prices = {
    "coffee": 10,
    "tea": 7,
    "water": 5,
    "milk": 15,
    "juice": 10,
}

total_sum = 0

message = "Введіть назву напою, або 'end' для завершення виконання програми: "
messageIfNotInMenu = "Назва напою не існує в меню. Спробуйте ще раз: "

input_value = input(message)

while input_value != "end":
    if input_value in menu_prices:
        total_sum += menu_prices[input_value]
        input_value = input(message)
        continue
    else:
        input_value = input(messageIfNotInMenu)
        continue

if input_value == "end":
    print(f"Загальна сума замовлення: {total_sum}")
