# Тема: Відстеження кількості продуктів на складі
# Завдання:
# Створіть програму для управління запасами на складі.
# Програма має словник `product_stock`, де ключі - це назви продуктів,
# а значення - кількість наявних одиниць. Користувач вводить назву продукту та кількість,
# яку потрібно додати або відняти (наприклад, "+5" або "-3"). Програма має оновлювати кількість продуктів
# у словнику та виводити оновлену інформацію. Коли користувач вводить "end",
# програма повинна вивести кінцевий стан запасів у форматі словника.

# Очікуваний результат: Якщо у `product_stock` є продукти {"apples": 20, "bananas": 15},
# і користувач вводить "apples +5", "bananas -2", "end", програма виводить: {'apples': 25, 'bananas': 13}.

# Послідовність виконання:
# 1. Створіть словник `product_stock` з назвами продуктів та їхньою кількістю.
# 2. Використовуйте цикл для читання вводу від користувача.
# 3. Обробляйте введені дані, розбиваючи їх на назву продукту та зміну кількості.
# 4. Оновлюйте кількість продукту у словнику відповідно до введеної інформації.
# 5. Після отримання "end" виведіть кінцевий стан запасів.

product_stock = {
    "coffee": 10,
    "tea": 7,
    "water": 5,
    "milk": 15,
    "juice": 10,
    "apples": 20,
    "bananas": 15,
    "oranges": 12,
    "pears": 10,
    "grapes": 15,
}

while True:
    user_input = input(
        'Введіть назву продукту та зміну кількості (Приклад "coffee -> +5"): '
    )
    if user_input == "end":
        print("Кінцевий стан запасів:")
        for name, amount in product_stock.items():
            print(f"{name}: {amount}")
        break
    name, change = user_input.split(" -> ")
    change = int(change)
    if name not in product_stock:
        print(f"Такого продукту не існує: {name}")
        continue
    product_stock[name] += change
