# #### Тема:
# Функції та обробка числових даних

# #### Завдання:
# Створіть функцію `convert_temperature`, яка конвертує температуру з градусів Цельсія в градуси
# Фаренгейта та навпаки.
#
# Функція повинна приймати числове значення температури та одиниці виміру ('C' для Цельсія, 'F' для Фаренгейта)
# і повертати перетворене значення.

# #### Очікуваний результат:
# Функція конвертує температуру між градусами Цельсія та Фаренгейта.

# #### Послідовність виконання:
# 1. Визначте функцію `convert_temperature`, яка приймає два параметри:
# `temperature` (числове значення температури)
# та `unit` (одиниця виміру - 'C' або 'F').
# 2. Функція має перевіряти одиницю виміру та відповідно конвертувати температуру.
# 3. Формули конвертації:
#    - Цельсій у Фаренгейт: ( (°C × 9/5) + 32 )
#    - Фаренгейт у Цельсій: ( (°F − 32) × 5/9 )
# 4. Функція повинна повертати перетворене значення температури.
# 5. Перевірте роботу функції на різних вхідних даних.


def convert_temperature(temperature, unit):
    temperature = float(temperature)
    if unit == "C":
        return (temperature * 9 / 5) + 32
    elif unit == "F":
        return (temperature - 32) * 5 / 9
    else:
        return "Некоректна одиниця виміру. Введіть 'C' або 'F'."


temp_input = input("Введіть числове значення температури: ")
unit_input = input("Введіть одиниця виміру - 'C' або 'F': ")

result = convert_temperature(temp_input, unit_input)
print(f"Результат конвертації: {result}")
