# ### Завдання

# #### Тема:
# Функції та управління рядками

# #### Завдання:
# Напишіть функцію `analyze_text`, яка приймає текст, введений користувачем через `input()`,
# і аналізує його на предмет кількості слів та середньої довжини слова.

# #### Очікуваний результат:
# Функція повертає кількість слів у тексті та середню довжину слова.

# #### Послідовність виконання:
# 1. Визначте функцію `analyze_text`, яка приймає один параметр: `text` (текст для аналізу).
# 2. Функція має розділити текст на слова та підрахувати їх кількість.
# 3. Функція також має обчислити середню довжину слова в тексті.
# 4. Запросіть користувача ввести текст через `input()`.
# 5. Викликайте `analyze_text` з введеним текстом.
# 6. Виведіть результати аналізу: кількість слів та середня довжина слова.
# 7. Переконайтеся, що функція коректно обробляє різні вхідні дані.


def analyze_text(text):
    total_length = 0
    words = text.split()
    total_words = len(words)
    for word in words:
        total_length += len(word)
    ave_length = total_length / total_words
    return ave_length, total_words


user_text = input("Ввод тексту: ")
ave_length, total_words = analyze_text(user_text)
print(f"Кількість слів: {total_words} \b Середня довжина слова: {ave_length}")
