# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `city` та присвойте їй назву міста, де ви народилися, у вигляді рядка.
# 2. Створіть змінну `population` та присвойте їй приблизну кількість жителів цього міста у вигляді цілого числа.
# 3. Створіть змінну `averageHeight` та присвойте їй середню висоту будівель у вашому місті
# у метрах у вигляді числа з плаваючою комою (наприклад, 10.5).
# 4. Виведіть на екран повідомлення у форматі:
# "Я народився в місті [city].
# Тут живе приблизно [population] людей, а середня висота будівель - [averageHeight] метрів."

# Очікуваний результат:
# ```
# Я народився в місті Львів.
# Тут живе приблизно 720000 людей, а середня висота будівель - 12.2 метрів.
# ```
# Примітка: Замініть "Львів", "720000" та "12.2" на власні значення, які ви ввели.

city = "Устинівка"

population = 3233

averageHeight = 5

print(f"Я народився в місті {city}.")
print(f"Тут живе приблизно {population} людей, а середня висота будівель - {averageHeight} метрів.")

