# ### Завдання

# #### Тема:
# Функції та управління рядками

# #### Завдання:
# Напишіть функцію `analyze_text`, яка приймає текст, введений користувачем через `input()`,
# і аналізує його на предмет кількості слів та середньої довжини слова.

# #### Очікуваний результат:
# Функція повертає кількість слів у тексті та середню довжину слова.

# #### Послідовність виконання:
# 1. Визначте функцію `analyze_text`, яка приймає один параметр: `text` (текст для аналізу).
# 2. Функція має розділити текст на слова та підрахувати їх кількість.
# 3. Функція також має обчислити середню довжину слова в тексті.
# 4. Запросіть користувача ввести текст через `input()`.
# 5. Викликайте `analyze_text` з введеним текстом.
# 6. Виведіть результати аналізу: кількість слів та середня довжина слова.
# 7. Переконайтеся, що функція коректно обробляє різні вхідні дані.


def analyze_text(text):
    words = text.split()
    word_count = len(words)
    total_lenght = 0
    for word in words:
        total_lenght += len(word)
    avg_lenght = total_lenght/ word_count
    return word_count, avg_lenght
    

text = input("Введіть текст")
result_count, result_avg = analyze_text(text)

print(f"Кількість слів у тексті: {result_count}")
print(f"Середня довжина слова: {result_avg}")




        
            

        
        
        
    