# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача два числа через `input()`.
# Програма повинна виконувати базові арифметичні операції (додавання, віднімання, множення, ділення)
# з цими числами і виводити результати на екран.

# Очікуваний результат:
# ```
# Введіть перше число: 5
# Введіть друге число: 3

# Результати:
# 5 + 3 = 8
# 5 - 3 = 2
# 5 * 3 = 15
# 5 / 3 = 1.6666666666666667

перше_число = float(input("Введіть перше число: "))
друге_число = float(input("Введіть друге число: "))


print("Результати:")
print(f"{перше_число} + {друге_число} = {перше_число + друге_число}")
print(f"{перше_число} - {друге_число} = {перше_число - друге_число}")
print(f"{перше_число} * {друге_число} = {перше_число * друге_число}")
print(f"{перше_число} / {друге_число} = {перше_число / друге_число}")