# 1. Є дві множини A = {3, 5, 11, 7, 4, -3} та B = {11, 5, 8, 1, 10, 7}.
# Вивести в консоль елементи A, яких немає в B.
# Вивести в консоль елементи B, яких немає в A.
# Вивести в консоль спільні елементи A і B.
# Вивести в консоль об'єднання множин A і B.

setA = {3, 5, 11, 7, 4, -3}
setB = {11, 5, 8, 1, 10, 7}

print("Елементи A, яких немає в B:", setA - setB)
print("Елементи B, яких немає в A:", setB - setA)
print("Cпільні елементи A і B:", setA & setB)
print("Об'єднання множин A і B:", setA | setB)
