# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `city` та присвойте їй назву міста, де ви народилися, у вигляді рядка.
# 2. Створіть змінну `temperature` та присвойте їй середню температуру в цьому
# місті літом у вигляді числа з плаваючою комою (наприклад, 25.5).
# 3. Створіть змінну `population` та присвойте їй приблизну кількість населення цього міста у вигляді цілого числа.
# 4. Виведіть на екран повідомлення у форматі:
# "Я народився в місті [city]. Літом тут середня температура - [temperature] градусів."
# "Населення міста складає приблизно [population] людей."

# Очікуваний результат:
# Я народився в місті Київ. Літом тут середня температура - 25.5 градусів.
# Населення міста складає приблизно 2900000 людей.

# Примітка: Замініть "Київ", "25.5" та "2900000" на власні значення, які ви ввели.
