# #### Тема:
# Функції та обробка числових даних

# #### Завдання:
# Створіть функцію `convert_temperature`, яка конвертує температуру з градусів Цельсія в градуси
# Фаренгейта та навпаки.
#
# Функція повинна приймати числове значення температури та одиниці виміру ('C' для Цельсія, 'F' для Фаренгейта)
# і повертати перетворене значення.

# #### Очікуваний результат:
# Функція конвертує температуру між градусами Цельсія та Фаренгейта.

# #### Послідовність виконання:
# 1. Визначте функцію `convert_temperature`, яка приймає два параметри:
# `temperature` (числове значення температури)
# та `unit` (одиниця виміру - 'C' або 'F').
# 2. Функція має перевіряти одиницю виміру та відповідно конвертувати температуру.
# 3. Формули конвертації:
#    - Цельсій у Фаренгейт: ( (°C × 9/5) + 32 )
#    - Фаренгейт у Цельсій: ( (°F − 32) × 5/9 )
# 4. Функція повинна повертати перетворене значення температури.
# 5. Перевірте роботу функції на різних вхідних даних.

def convert_temperature(temperature, unit):
    if unit == 'C':
        # конвертація з Цельсія в Фаренгейт
        converted_temperature = (temperature * 9/5) + 32
        return converted_temperature
    elif unit == 'F':
        # конвертація з Фаренгейта в Цельсій
        converted_temperature = (temperature - 32) * 5/9
        return converted_temperature
    else:
        return "Невірна одиниця виміру. Введіть 'C' для Цельсія або 'F' для Фаренгейта."


temperature = float(input("Введіть температуру: "))
unit = input("Введіть одиниці виміру ('C' для Цельсія або 'F' для Фаренгейта): ").upper()
converted_temperature = convert_temperature(temperature, unit)
print(f"{temperature} градусів {unit} = {converted_temperature:.2f} градусів {'F' if unit == 'C' else 'C'}")
