# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `book` та присвойте їй назву вашої улюбленої книги у вигляді рядка.
# 2. Створіть змінну `price` та присвойте їй вартість цієї книги
# у вашому місті у вигляді числа з плаваючою комою (наприклад, 350.75).
# 3. Створіть змінну `pages` та присвойте їй кількість сторінок цієї книги у вигляді цілого числа.
# 4. Виведіть на екран повідомлення у форматі:
# "Моя улюблена книга - [book]. Вона коштує [price] гривень та має [pages] сторінок."

# Очікуваний результат:
# Моя улюблена книга - "Хобіт". Вона коштує 350.75 гривень та має 310 сторінок.

# Примітка: Замініть "Хобіт", "350.75" та "310" на власні значення, які ви ввели.
