# #### Тема:
# Функції та обробка рядків

# #### Завдання:
# Створіть функцію `password_strength`, яка аналізує силу пароля, введеного користувачем.
# Функція повинна приймати пароль і перевіряти його на мінімальну довжину, наявність цифр,
# великих та малих літер. Критерії для оцінки пароля як "Слабкий", "Середній" та "Сильний" вказані нижче.

# #### Очікуваний результат:
# Функція повертає рядок, який оцінює пароль як "Слабкий", "Середній" або "Сильний" на основі вказаних критеріїв.

# #### Критерії оцінки сили пароля:
# - Слабкий: Менше 8 символів; відсутність великих літер, малих літер або цифр.
# - Середній: Як мінімум 8 символів, включає комбінацію малих літер та цифр або великих літер та цифр.
# - Сильний: Як мінімум 8 символів, включає малі літери, великі літери та цифри.

# #### Послідовність виконання:
# 1. Визначте функцію `password_strength`, яка приймає один параметр: `password`.
# 2. Функція перевіряє пароль на відповідність вищевказаним критеріям.
# 3. На основі перевірки, функція повинна повертати оцінку сили пароля.
# 4. Запросіть користувача ввести пароль через `input()`.
# 5. Викликайте `password_strength` з введеним паролем.
# 6. Виведіть результат оцінки пароля.
# 7. Переконайтеся, що функція коректно обробляє різні вхідні дані.
def password_strength(password):
    if len(password) < 8:
        return "Слабкий"
    has_digit = any(char.isdigit() for char in password) 
    has_upper = any(char.isupper()  for char in password) 
    has_lower = any(char.islower()  for char in password)
    if has_digit and (has_upper or has_lower):
        return "Сильний"
    elif has_digit or   (has_upper and has_lower):
        return "Середній"
    else:
        return "Слабкий"
user_password = input("Введіть ваш пароль: ")
result = password_strength(user_password)
print(f"Оцінка сили пароля:{result}")
    