# 1. Є дві множини A = {3, 5, 11, 7, 4, -3} та B = {11, 5, 8, 1, 10, 7}.
# Вивести в консоль елементи A, яких немає в B.
# Вивести в консоль елементи B, яких немає в A.
# Вивести в консоль спільні елементи A і B.
# Вивести в консоль об'єднання множин A і B.
A = {3, 5, 11, 7, 4, -3}
B = {11, 5, 8, 1, 10, 7}

elements1 = A - B
print("Елементи A, яких немає в B:", elements1)

# Елементи B, яких немає в A
elements2 = B - A
print("Елементи B, яких немає в A:", elements2)

# Спільні елементи A і B
elements3 = A.intersection(B)
print("Спільні елементи A і B:", elements3)

# Об'єднання множин A і B
A_and_B = A.union(B)
print("Об'єднання множин A і B:", A_and_B)