# Тема:
# Використання оператора `or` для перевірки альтернативних умов.

# Завдання:
# Уявіть, що ви програмуєте систему знижок для книгарні.
# Клієнт може отримати знижку, якщо він є членом клубу книголюбів ('isClubMember') а
# бо якщо його покупка ('purchaseAmount') перевищує 500 гривень. Напишіть код,
# який запитує користувача, чи є він членом клубу (відповідь "так" або "ні") та суму його покупки,
# а потім виводить "Ви отримали знижку!" або "Ви не отримали знижку,
# але можете приєднатися до клубу або зробити покупку на суму понад 500 гривень".

# Очікуваний результат:
# Програма запитує у користувача, чи є він членом клубу та яка сума покупки,
# а потім виводить відповідне повідомлення про знижку.
