# Тема:
# Використання комбінації логічних операторів `and` та `or` з `input` для визначення
# кваліфікації на отримання кредитної картки.

# Завдання:
# Банк видає кредитні картки клієнтам на основі двох критеріїв: вік клієнта та його доходу.
# Клієнт кваліфікується на отримання кредитної картки, якщо йому більше 18 років
# і водночас його дохід становить щонайменше 10000 гривень на місяць або якщо клієнт
# є студентом і його дохід становить щонайменше 5000 гривень на місяць. Створіть програму,
# яка запитує вік (`age`), місячний дохід (`monthlyIncome`) та статус студента (`isStudent`),
# обробляє цю інформацію і визначає, чи кваліфікується клієнт на кредитну картку.
# Виведіть повідомлення "Ви кваліфікуєтесь на отримання кредитної картки" або
# "Ви не кваліфікуєтесь на отримання кредитної картки", в залежності від результату.

# Очікуваний результат:
# Програма вимагає від користувача ввести свій вік, місячний дохід та статус студента,
# після чого використовує комбінацію операторів `and` та `or` для визначення,
# чи має користувач право на кредитну картку, і виводить відповідне повідомлення.
