# Тема: Основи роботи зі змінними та базовими типами даних

# Завдання:
# 1. Створіть змінну `city` і присвойте їй назву вашого рідного міста у вигляді рядка.
# 2. Створіть змінну `population` і присвойте їй приблизну кількість населення вашого міста у вигляді цілого числа.
# 3. Створіть змінну `averageTemperature` і присвойте їй середню температуру
# в вашому місті за літо у вигляді числа з плаваючою комою.
# 4. Виведіть на екран інформацію у форматі:
# "Я народився в місті [city]. Населення моєї батьківщини - приблизно [population] людей.
# Середня температура літом тут близько [averageTemperature] градусів."

# Очікуваний результат:
# ```
# Я народився в місті Київ. Населення моєї батьківщини - приблизно 2884000 людей.
# Середня температура літом тут близько 24.5 градусів.
# ```

# Примітка: Замініть "Київ", "2884000" та "24.5" на власні значення, які ви ввели.
city = input('Моє рідне місто ')
population = input('Приблизна кількість населення ')
averageTemperature = input('Середня температура літом ')
print (f'Я народився в місті {city}. Населення моєї батьківщини - приблизно {population} людей. Середня температура літом тут близько {averageTemperature} градусів.')