# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача відстань між двома містами
# в кілометрах та вартість бензину за літр через `input()`.
# Припустимо, що автомобіль споживає 8 літрів бензину на 100 км.
# Програма повинна розраховувати, скільки грошей потрібно на бензин,
# щоб проїхати цю відстань, та вивести це значення на екран.

s = int(input("\nВведіть відстань між містами (км): "))
price = int(input("Введіть вартість бензину за літр (грн): "))
result = 0.08 * s * price

print(f"\nНа бензин вам потрібно: {result} грн.\n")

# Очікуваний результат:
# ```
# Введіть відстань між містами (км): 250
# Введіть вартість бензину за літр (грн): 30

# На бензин вам потрібно: 600.0 грн.
