# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача ширину,
# довжину та висоту кімнати в метрах через `input()`.
# Програма повинна розраховувати об'єм кімнати та вивести це значення на екран.

w = float(input("\nВведіть ширину кімнати (м): "))
l = float(input("Введіть довжину кімнати (м): "))
h = float(input("Введіть висоту кімнати (м): "))
v = w * l * h 

print(f"\nОб'єм кімнати: {v} куб. м.\n")

# Очікуваний результат:
# ```
# Введіть ширину кімнати (м): 4
# Введіть довжину кімнати (м): 5
# Введіть висоту кімнати (м): 2.5

# Об'єм кімнати: 50.0 куб. м.
# ```
