# Тема: Інформація про книгу

# Завдання:
# 1. Створіть змінну `bookTitle` та присвойте їй назву будь-якої книги.
# 2. Створіть змінну `publicationYear` та присвойте їй рік видання книги у вигляді цілого числа.
# 3. Створіть змінну `pagePrice` та присвойте їй вартість однієї сторінки книги у вигляді числа з плаваючою комою.
# 4. Виведіть на екран інформацію у форматі:
# "Книга "[bookTitle]" була видана в [publicationYear] році. Вартість однієї сторінки - [pagePrice] грн."

# Очікуваний результат:
# ```
# Книга "Віденьський ліс" була видана в 1987 році. Вартість однієї сторінки - 0.75 грн.
# ```
# Примітка: Замініть "Віденьський ліс", "1987" та "0.75" на власні значення, які ви ввели.

bookTitle = "І не лишилось жодного"
publicationYear = "1939"
pagePrice = 0.9
print(f"Книга \"{bookTitle}\" була видана в {publicationYear} році. Вартість однієї сторінки - {pagePrice} грн.")