# ```
# Тема: Розрахунок прибутку за вкладом.

# Завдання:
# Напишіть програму на Python, яка розраховує суму прибутку, яку отримає користувач по вкладу у банку. Програма має:
# 1. Запитати суму первісного вкладу.
# 2. Запитати річну відсоткову ставку по вкладу.
# 3. Запитати кількість років, на які робиться вклад.
# 4. Врахувати, що прибуток нараховується на кінець кожного року та додається до суми вкладу.
# 5. Вивести суму прибутку, яку отримає користувач після зазначеного періоду.

# Формула для розрахунку прибутку за вкладом (складні проценти):
# Прибуток = Первісна сума вкладу * ((1 + (Відсоткова ставка / 100)) ^ Кількість років) - Первісна сума вкладу

# Очікуваний результат:
# ```
# Введіть суму первісного вкладу: 10000
# Введіть річну відсоткову ставку: 5
# Введіть кількість років вкладу: 10
# Сума вашого прибутку за вкладом становитиме: 6288.95 UAH
# ```

# start of task
depositAmount = int(input("Введіть суму первісного вкладу: "))
depositInterest = int(input("Введіть річну відсоткову ставку: "))
depositTerm = int(input("Введіть кількість років вкладу: "))
depositProfit = depositAmount * ((1 + (depositInterest / 100)) ** depositTerm) - depositAmount
print(f"Сума вашого прибутку за вкладом становитиме: {round(depositProfit, 2)} UAH")
# end of task