# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `book` та присвойте їй назву улюбленої книги, у вигляді рядка.
# 2. Створіть змінну `pages` та присвойте їй кількість сторінок цієї книги у вигляді цілого числа.
# 3. Створіть змінну `weight` та присвойте їй вагу цієї книги у грамах
# у вигляді числа з плаваючою комою (наприклад, 320.4).
# 4. Виведіть на екран повідомлення у форматі: "Моя улюблена книга - [book].
# Вона має [pages] сторінок і важить приблизно [weight] грамів."

# Очікуваний результат:
# ```
# Моя улюблена книга - "Гаррі Поттер і філософський камінь". Вона має 309 сторінок і важить приблизно 450.7 грамів.
# ```

# Примітка: Замініть "Гаррі Поттер і філософський камінь", "309" та "450.7" на власні значення, які ви ввели.
