# Тема:
# Використання оператора `and` для перевірки декількох умов одночасно.

# Завдання:
# Уявіть, що ви пишете програму для кінотеатру, яка перевіряє вік і
# час для визначення ціни квитка.
#
# Квиток для дітей (вік до 14 років включно) коштує 50 гривень,
# для дорослих у робочі дні (вік від 15 років та час до 17:00) — 70 гривень,
#
# а після 17:00 та у вихідні — 90 гривень.
#
# Користувач вводить свій вік та поточний час (в годинах).
#
# Ви повинні вивести вартість квитка згідно з введеними даними.

# Очікуваний результат:
# Програма отримує вік користувача та час, потім використовує `if` і `and`
# для визначення правильної ціни квитка і виводить її.
#
# Наприклад, якщо користувач введе вік 13 років і час 16:00,
# результатом буде "Вартість квитка: 50 гривень". Я
#
# кщо введуть вік 16 років і час 18:00, результатом буде "Вартість квитка: 90 гривень".
