# Тема: Обробка замовлення в кафе з використанням циклів та словників

# Завдання:
# Уявіть, що ви пишете програму для кафе, де клієнти можуть замовляти різні напої.
# Створіть словник `menu_prices`, де ключами будуть назви напоїв, а значеннями - їх ціни.
# Після цього, напишіть код, який запитує у користувача, що він хоче замовити,
# і додає ціну обраного напою до загальної суми замовлення. Якщо користувач вводить "end",
# програма повинна вивести загальну суму замовлення.

# Очікуваний результат:
# Наприклад, якщо в `menu_prices` є напої {"coffee": 10, "tea": 7, "water": 5},
# і користувач замовляє "coffee" та "water", а потім вводить "end",
# програма виводить "Загальна сума замовлення: 15".

# Послідовність виконання:
# 1. Створіть словник `menu_prices` з назвами страв та їхніми цінами.
# 2. Ініціалізуйте змінну для зберігання загальної вартості замовлення.
# 3. Використовуйте цикл для читання вводу від користувача.
# 4. Якщо введено назву страви, яка є в словнику, додайте її вартість до загальної суми.
# 5. Якщо введено "end", виведіть загальну вартість замовлення.

menu_prices = {"coffee": 10, "tea": 7, "water": 5 }
total_order_price = 0
while True:
    order_item = input("Введіть назву напою або 'end' для звершення: ")
    if order_item.lower() == 'end':
        print(f"Загальна сума замовлення: {total_order_price}")
        break
    elif order_item in menu_prices:
        total_order_price += menu_prices[order_item]
        print(f"Додано {order_item}. Поточна загальна сума: {total_order_price}.")
    else:
        print("Невірна назва напою. Спробуйте ще раз.")
        