# ```
# Тема: Створення та виведення списку (list) у Python.

# Завдання: Напишіть програму на Python, яка створює список з назв `teamMembers`,
# що містить імена членів команди розробників.
# Список повинен містити щонайменше п'ять імен.
# Після створення списку, програма має вивести цей список в консоль, де кожне ім'я виводиться на новому рядку.

# Очікуваний результат:
# Консоль повинна показати імена членів команди розробників, виведені одне під одним. Наприклад:
# ```
# ```
# Андрій
# Олена
# Сергій
# Ірина
# Дмитро
# ```
# ```

team = [
    'Андрій',
    'Олена',
    'Сергій',
    'Ірина',
    'Дмитро',
]

print(team[0])
print(team[1])
print(team[2])
print(team[3])
print(team[4])
