# Тема: Використання циклу while з оператором break

# Завдання:
# Напишіть програму, яка зчитує цілі числа, введені користувачем,
# поки не зустріне від'ємне число. При введенні від'ємного числа програма має негайно зупинитися
# і вивести кількість позитивних чисел, введених до цього, не включаючи від'ємне число.

# Очікуваний результат:
# Якщо користувач послідовно вводить числа: 1, 3, 5, -1, то програма повинна вивести:
# ```
# Введено від'ємне число. Кількість введених позитивних чисел: 3
# ```

# Послідовність виконання:
# 1. Ініціалізуйте лічильник позитивних чисел (positive_count) зі значенням 0.
# 2. Використовуйте цикл while з нескінченним циклом (while True).
# 3. Отримайте введення від користувача всередині циклу.
# 4. Перевірте, чи введене число є від'ємним. Якщо так, використайте break для виходу з циклу.
# 5. Якщо число позитивне, збільшіть лічильник на одиницю.
# 6. Після виходу з циклу виведіть кількість позитивних чисел.
posit_num = 0
while True:    
    num = int(input("Введіть ціле число: "))
    if num < 0:
        print(f"Введено відємне число. кількість введених чисел: {posit_num}")        
        break
    posit_num += 1