# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `name` та присвойте їй своє ім'я у вигляді рядка.
# 2. Створіть змінну `age` та присвойте їй свій вік у вигляді цілого числа.
# 3. Створіть змінну `avarage_score` та присвойте їй
# ваш середній бал у вигляді числа з плаваючою комою (наприклад, 84.5).
# 4. Виведіть на екран повідомлення у форматі:
# "Моє ім'я [ім'я]. Мені [вік] років. Мій середній бал в університеті - [середній_бал]."

# Очікуваний результат:
# Моє ім'я Олег. Мені 20 років. Мій середній бал в університеті - 4.5.

# Примітка: Замініть "Олег", "20" та "4.5" на власні значення, які ви ввели.
