# ```
# Тема: Сортування списку за допомогою методу sort() та отримання даних від користувача через input.

# Завдання: Напишіть програму, яка запитує у користувача ввести три числа, одне за одним. Кожне число користувач
# вводить після підказки "Введіть число:" і натискання Enter.
# Ваша програма має зберігати ці числа у списку з назвою `numbersList`.
# Після збору всіх трьох чисел, використайте метод `sort()`
# для сортування списку `numbersList` від найменшого до найбільшого числа.
# Виведіть відсортований список на екран.

# Очікуваний результат:
# Програма запитує у користувача три числа, зберігає їх у списку, сортує список та виводить його.
# Наприклад, якщо користувач ввів числа 56, 23 та 78, відсортований список має виглядати так:
# ```
# ```
# [23, 56, 78]
# ```
numbersList = []

num1 = float(print('Введіть перше число: '))
num2 = float(print('Введіть друге число: '))
num3 = float(print('Введіть третє число: '))

numbersList.append(num1)
numbersList.append(num2)
numbersList.append(num3)
numbersList.sort()
print('Відсортований список чисел:', numbersList)