# ```
# Тема: Використання від'ємних індексів для доступу до елементів списку.

# Завдання: Створіть список з назвою `colors`, який містить назви кольорів (як рядки),
# наприклад, `['червоний', 'зелений', 'синій', 'жовтий', 'фіолетовий']`.
# Ваша програма має вивести на екран останній елемент списку, використовуючи від'ємну індексацію,
# а потім передостанній елемент, також використовуючи від'ємну індексацію.

# Очікуваний результат: Коли ваша програма буде виконана, вона має вивести наступне в консоль:
# ```
# ```
# фіолетовий
# жовтий
# ```

colors = ['червоний', 'зелений', 'синій', 'жовтий', 'фіолетовий']
last_color = colors[-1]
print('Останній елемент списку: ', last_color)
second_last_color = colors [-2]
print('Передостаннійелемент списку: ', second_last_color)
