# Тема: Використання змінних та базових типів даних у реальних умовах

# Завдання:
# 1. Створіть змінну `bookTitle` і присвойте їй назву вашої улюбленої книги.
# 2. Створіть змінну `pagesCount` і присвойте їй кількість сторінок у цій книзі у вигляді цілого числа.
# 3. Створіть змінну `rating` і присвойте їй вашу особисту оцінку книги
# у вигляді числа з плаваючою комою від 1.0 до 5.0.
# 4. Виведіть на екран інформацію у форматі: "Моя улюблена книга - [bookTitle].
# Вона має [pagesCount] сторінок. Я оцінюю цю книгу на [rating] балів із 5."

# Очікуваний результат:
# ```
# Моя улюблена книга - "Майстер і Маргарита". Вона має 500 сторінок. Я оцінюю цю книгу на 4.7 балів із 5.
# ```
# Примітка: Замініть "Майстер і Маргарита", "500" та "4.7" на власні значення, які ви ввели.
