# Тема:
# Умовні оператори if-else в Python

# Завдання:
# Створіть скрипт Python, який аналізує значення двох змінних: `income` (дохід)
# та `expenses` (витрати). Скрипт повинен визначити, чи є бюджет позитивним (дохід більший за витрати),
# негативним (дохід менший за витрати), чи в балансі (дохід дорівнює витратам).
# На основі аналізу скрипт повинен вивести одне з наступних повідомлень:

# 1. "Ваш бюджет позитивний. Ви у плюсі на: [сума] грн."
# 2. "Ваш бюджет негативний. Ви у мінусі на: [сума] грн."
# 3. "Ваш бюджет збалансований. Ви на нулі."

# Для реалізації скористайтеся умовними операторами `if`, `elif` та `else`.
# Також не забудьте процес обчислення абсолютного значення різниці доходів та витрат, якщо бюджет негативний.

# Очікуваний результат:
# Програма приймає значення доходів та витрат від користувача, обробляє їх
# і виводить відповідне повідомлення згідно з логікою, описаною вище.

# start of task
# шутка про python-ista, sharp-era i js-era
"""
Питонист, Шарпер и Джаваскриптер сидели в баре, обсуждая свои языки программирования.
Питонист сказал: "Мой питон легко скользит по коду, как змея по траве."
Шарпер ответил: "У нас в Sharp все острие и строго, как мой код."
Джаваскриптер поднял брови и сказал: "А мой код... ну, он просто всегда выполняется, хотя иногда и сам не знает почему!"
"""
income = int(input("Введіть дохід: "))
expenses = int(input("Введіть витрати: "))
if income > expenses:
	print(f"Ваш бюджет позитивний. Ви у плюсі на: {income - expenses} грн.")
elif income < expenses:
	print(f"Ваш бюджет негативний. Ви у мінусі на: {expenses - income} грн.")
else:
	print("Ваш бюджет збалансований. Ви на нулі.")
# end of task