# Тема:
# Перевірка на відсутність заборгованості перед відкриттям нового рахунку.

# Завдання:
# Розробіть скрипт, який за допомогою `input` з'ясовує у потенційного клієнта банку,
# чи є у нього наявна заборгованість по інших банківських продуктах. Використовуйте змінну `hasDebt`
# для зберігання введеного значення (так або ні).
# Якщо користувач введе, що заборгованість відсутня, виведіть повідомлення
# "Ви можете відкрити новий рахунок", використовуючи оператор `not` для перевірки умови.
#
# У протилежному випадку виведіть "Ви не можете відкрити новий рахунок через наявну заборгованість".

# Очікуваний результат:
# Програма запитує у користувача про наявність заборгованості
# та використовує оператор `not` для визначення можливості відкриття нового рахунку.
# Відповідно до введеної відповіді програма виводить відповідне повідомлення.

# start of task
hasDebt = input("Чи є у вас заборгованість по інших банківських продуктах? (так/ні)\n> ")
if not hasDebt == "так":
	print("Ви можете відкрити новий рахунок")
else:
	print("Ви не можете відкрити новий рахунок через наявну заборгованість")
# end of task