# Тема: Цикли for, робота зі списками і функцією input

# Завдання: Написати програму, яка зчитує п'ять чисел від користувача, зберігає їх у список,
# а потім виводить ці числа в зворотньому порядку.

# Очікуваний результат: Програма просить користувача ввести п'ять чисел, одне за одним.
# Кожне введене число додається до списку. Після введення всіх п'яти чисел, програма виводить ці числа
# в зворотньому порядку від останнього до першого.

# Послідовність виконання:
# 1. Ініціалізувати пустий список (наприклад, `input_numbers`).
# 2. Використовуючи цикл `for` та функцію `range`, зробити п'ять ітерацій.
# 3. У кожній ітерації, використовуючи `input()`, зчитати число від користувача та
# одати його до списку `input_numbers`.
# 4. Після завершення циклу, використай цикл `for` для виведення чисел у зворотньому порядку.


# Виведення чисел у зворотньому порядку
# for number in reversed(input_numbers):

input_numbers = []

for i in range (5):
    
    num = int(input("Введіть число: "))

    print(f"Число користувача {num}")

    input_numbers.append(num)

    for i in reversed(input_numbers):

        print(i)