# ```
# Тема: Зрізи списків (Slicing) у Python.

# Завдання: Створіть список з назвою `numbers`, що містить перші десять цілих чисел (від 0 до 9).
# Використовуйте зрізи списків, щоб створити новий список `middleNumbers`,
# який містить тільки другий, третій і четвертий елементи початкового списку `numbers`.
# Виведіть новий список `middleNumbers` на екран.

# Очікуваний результат:
# Після виконання скрипта в консолі мають бути виведені елементи нового списку `middleNumbers`,
# як показано нижче:
# ```
# ```
# [1, 2, 3]
# ```
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

middleNumbers = numbers[1:4]

print(middleNumbers)