# Тема: Змінні та базові типи даних

# Завдання:
# 1. Створіть змінну `city` та присвойте їй назву вашого рідного міста у вигляді рядка.
# 2. Створіть змінну `population` та присвойте їй приблизну кількість населення цього міста у вигляді цілого числа.
# 3. Створіть змінну `area` та присвойте їй площу цього міста у вигляді числа з плаваючою комою (наприклад, 120.5 км²).
# 4. Виведіть на екран повідомлення у форматі:
# "Я народився в місті [city]. Його населення - приблизно [population] людей, а площа - [area] км²."

# Очікуваний результат:
# ```
# Я народився в місті Львів. Його населення - приблизно 721301 людей, а площа - 182.8 км².
# ```
# Примітка: Замініть "Львів", "721301" та "182.8" на власні значення, які ви ввели.
city = "Бородянка"
population = str("13157")
area = str("6,5")
print("Я народився в місті "+city+". Його населення - приблизно "+population+" людей, а площа - "+area+" км².")