# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Напишіть програму, яка запитує у користувача кількість днів, годин, хвилин та секунд через `input()`.
# Програма повинна перевести ці дані у загальну кількість секунд та вивести це значення на екран.

# Очікуваний результат:
# ```
# Введіть кількість днів: 2
# Введіть кількість годин: 5
# Введіть кількість хвилин: 30
# Введіть кількість секунд: 15

# Загальна кількість секунд: 189015 сек.


days = int(input("Введіть кількість днів: "))
hours = int(input("Введіть кількість годин: "))
minutes = int(input("Введіть кількість хвилин: "))
seconds = int(input("Введіть кількість секунд: "))


total_seconds = days * 24 * 60 * 60 + hours * 60 * 60 + minutes * 60 + seconds


print(f"Загальна кількість секунд: {total_seconds} сек.")
