# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Створіть програму для розрахунку вартості покупки в магазині.
# Програма повинна запитати у користувача ціну за одиницю товару,
# кількість товарів, яку клієнт хоче купити, та відсоток податку на додану вартість (ПДВ).
# Вона повинна вивести на екран суму до сплати без ПДВ, суму ПДВ та загальну суму до сплати.

# Очікуваний результат:
# ```
# Введіть ціну за одиницю товару: 50
# Введіть кількість товарів: 3
# Введіть відсоток ПДВ: 20

# Сума до сплати без ПДВ: 150.00 грн.
# Сума ПДВ: 30.00 грн.
# Загальна сума до сплати: 180.00 грн.
# ```
