# Тема: Арифметичні оператори та ввод даних через `input`.

# Завдання:
# Створіть програму для розрахунку вартості покупки в магазині.
# Програма повинна запитати у користувача ціну за одиницю товару,
# кількість товарів, яку клієнт хоче купити, та відсоток податку на додану вартість (ПДВ).
# Вона повинна вивести на екран суму до сплати без ПДВ, суму ПДВ та загальну суму до сплати.

# Очікуваний результат:
# ```
# Введіть ціну за одиницю товару: 50
# Введіть кількість товарів: 3
# Введіть відсоток ПДВ: 20

# Сума до сплати без ПДВ: 150.00 грн.
# Сума ПДВ: 30.00 грн.
# Загальна сума до сплати: 180.00 грн.
# ```


price_per_unit = float(input("Введіть ціну за одиницю товару: "))
quantity = int(input("Введіть кількість товарів: "))
tax_percentage = float(input("Введіть відсоток ПДВ: "))


subtotal = price_per_unit * quantity
tax_amount = (subtotal * tax_percentage) / 100
total_amount = subtotal + tax_amount


print(f"Сума до сплати без ПДВ: {subtotal:.2f} грн.")
print(f"Сума ПДВ: {tax_amount:.2f} грн.")
print(f"Загальна сума до сплати: {total_amount:.2f} грн.")
