# Тема: Реєстрація користувачів на заході
# Завдання: Напишіть функцію `register_user`, яка запитує у користувача його ім'я та email,
# а потім додає цю інформацію до словника `user_registry`.
#
# Ключем у словнику повинен бути email, а значенням - ім'я користувача.
# Створіть другу функцію `display_users`, яка виводить список всіх зареєстрованих користувачів.
# Організуйте цикл, в якому користувач може ввести декілька разів команду 'register' для реєстрації або 'display'
# для відображення зареєстрованих користувачів. Цикл завершується, коли користувач вводить 'exit'.

# Очікуваний результат: Якщо користувач вводить 'register',
# вказує своє ім'я та email, а потім вводить 'display',
# програма виводить список усіх зареєстрованих користувачів.

# Послідовність виконання:
# 1. Визначте функцію `register_user`, яка запитує ім'я та email користувача та додає ці дані
# до словника `user_registry`.
# 2. Визначте функцію `display_users` для виводу інформації про зареєстрованих користувачів.
# 3. Організуйте головний цикл, який читає команди від користувача ('register', 'display', 'exit').
# 4. Використовуйте умовні оператори для визначення дій, які потрібно виконати в залежності від введеної команди.

user_registry = {}

messageToGetCommand = "📁 Введіть reg, щоб зареєструвати нового користувача, list,\nщоб відобразити всіх зареєстрованих користувачів, або exit, щоб вийти: "
messageToConfirmRegister = (
    "❗ Ви впевнені, що хочете зареєструвати нового користувача? (Так, Ні): "
)


def register_user() -> None:
    name = input("👤 Введіть своє ім'я: ")
    email = input("📧 Введіть свій емейл: ")
    confirm = input(messageToConfirmRegister)
    if confirm == "Ні":
        pass
    elif confirm == "Так":
        user_registry[email] = name
        print("✅ Користувач зареєстрований успішно.")
    else:
        pass


def display_users() -> None:
    print("👥 Зареєстровані користувачі:")
    for email, name in user_registry.items():
        print(f"👤 {name}: {email} 📧")


def main() -> None:
    while True:
        command = input(messageToGetCommand)
        if command == "reg":
            register_user()
        elif command == "list":
            display_users()
        elif command == "exit":
            break
        else:
            print("❌ Неправильна команда. Спробуйте ще раз: ")


main()
