# #### Тема:
# Функції та обробка рядків

# #### Завдання:
# Створіть функцію `password_strength`, яка аналізує силу пароля, введеного користувачем.
# Функція повинна приймати пароль і перевіряти його на мінімальну довжину, наявність цифр,
# великих та малих літер. Критерії для оцінки пароля як "Слабкий", "Середній" та "Сильний" вказані нижче.

# #### Очікуваний результат:
# Функція повертає рядок, який оцінює пароль як "Слабкий", "Середній" або "Сильний" на основі вказаних критеріїв.

# #### Критерії оцінки сили пароля:
# - Слабкий: Менше 8 символів; відсутність великих літер, малих літер або цифр.
# - Середній: Як мінімум 8 символів, включає комбінацію малих літер та цифр або великих літер та цифр.
# - Сильний: Як мінімум 8 символів, включає малі літери, великі літери та цифри.

# #### Послідовність виконання:
# 1. Визначте функцію `password_strength`, яка приймає один параметр: `password`.
# 2. Функція перевіряє пароль на відповідність вищевказаним критеріям.
# 3. На основі перевірки, функція повинна повертати оцінку сили пароля.
# 4. Запросіть користувача ввести пароль через `input()`.
# 5. Викликайте `password_strength` з введеним паролем.
# 6. Виведіть результат оцінки пароля.
# 7. Переконайтеся, що функція коректно обробляє різні вхідні дані.

def password_strength(password):
    if len(password) < 8:
        return "Слабкий"

    lower = any(code.islower() for code in password)

    upper = any(code.isupper() for code in password)

    digit = any(code.isdigit() for code in password)

    if digit and (lower or upper):
        return "Сильний"

    elif digit or (lower and upper):
        return "Середній"

    else:
        return "Слабкий"


user = input("Введіть пароль: ")

level = password_strength(user)

print(level)
