# Тема:
# Застосування оператора `and` для формування складних умов.

# Завдання:
# Створіть скрипт, що визначає, чи має особа право на отримання
# пільгового тарифу для проїзду у громадському транспорті.
#
# Пільговий тариф доступний для осіб, які є пенсіонерами (вік 65 років і старше)
# та є резидентами міста. Скрипт повинен запитати в користувача його вік та
# чи є він резидентом міста (можна ввести 'так' або 'ні').
#
# Якщо користувач відповідає умовам, програма повинна вивести
# "Ви маєте право на пільговий тариф", у протилежному випадку - "Ви не маєте право на пільговий тариф".

# Очікуваний результат
# Користувач вводить свій вік та відповідає на питання про резидентство в місті,
# а програма виводить повідомлення про наявність або відсутність права на пільговий тариф.
preferential_tariff = int(input("Введіть свій вік "))
city_resident = input("Чи є ви резидентом міста (Так або Ні) ")
if preferential_tariff >= 65 and city_resident.lower() == "так":
   print("Ви маєте право на пільговий тариф")
else:
    print("Ви не маєте право на пільговий тариф")
